mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/mb9bf36xl/mb9bf36xl.svd
        <!-- REGISTER "GATEC8" -->
        <register>
          <name>GATEC8</name>
          <description>PPG Gate Function Control Registers 8 [BHW]</description>
          <addressOffset>0x298</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "STRG10" -->
            <field>
              <name>STRG10</name>
              <description>Select a trigger for PPG10</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EDGE10" -->
            <field>
              <name>EDGE10</name>
              <description>Select Start Effective Level for PPG10</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STRG8" -->
            <field>
              <name>STRG8</name>
              <description>Select a trigger for PPG8</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EDGE8" -->
            <field>
              <name>EDGE8</name>
              <description>Select Start Effective Level for PPG8</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "GATEC12" -->
        <register>
          <name>GATEC12</name>
          <description>PPG Gate Function Control Registers 12 [BHW]</description>
          <addressOffset>0x2D8</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "STRG14" -->
            <field>
              <name>STRG14</name>
              <description>Select a trigger for PPG14</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EDGE14" -->
            <field>
              <name>EDGE14</name>
              <description>Select Start Effective Level for PPG14</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STRG12" -->
            <field>
              <name>STRG12</name>
              <description>Select a trigger for PPG12</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EDGE12" -->
            <field>
              <name>EDGE12</name>
              <description>Select Start Effective Level for PPG12</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "GATEC16" -->
        <register>
          <name>GATEC16</name>
          <description>PPG Gate Function Control Registers 16 [BHW]</description>
          <addressOffset>0x318</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "STRG18" -->
            <field>
              <name>STRG18</name>
              <description>Select a trigger for PPG18</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EDGE18" -->
            <field>
              <name>EDGE18</name>
              <description>Select Start Effective Level for PPG18</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STRG16" -->
            <field>
              <name>STRG16</name>
              <description>Select a trigger for PPG16</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EDGE16" -->
            <field>
              <name>EDGE16</name>
              <description>Select Start Effective Level for PPG16</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "GATEC20" -->
        <register>
          <name>GATEC20</name>
          <description>PPG Gate Function Control Registers 20 [BHW]</description>
          <addressOffset>0x358</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "STRG22" -->
            <field>
              <name>STRG22</name>
              <description>Select a trigger for PPG22</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EDGE22" -->
            <field>
              <name>EDGE22</name>
              <description>Select Start Effective Level for PPG22</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STRG20" -->
            <field>
              <name>STRG20</name>
              <description>Select a trigger for PPG20</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EDGE20" -->
            <field>
              <name>EDGE20</name>
              <description>Select Start Effective Level for PPG20</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
